<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>Historia</title></head>
<body>
<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="UTF-8">
<title>L&iacute;nea del tiempo de la afici&oacute;n del Toluca</title>
<style>
  html, body {
    margin: 0;
    padding: 0;
    height: 100vh;
    font-family: Arial, sans-serif;
    color: #333;
  }

  body {
    background-image: url('https://www.record.com.mx/sites/default/files/articulos/2022/08/08/20170725_6570.jpg'); /* Cambia la URL por tu imagen */
    background-size: cover;
    background-position: center;
    background-repeat: no-repeat;
    overflow: hidden;
  }

  .timeline-container {
    height: 100%;
    width: 100%;
    overflow-y: auto;
    padding: 20px;
    box-sizing: border-box;
    display: flex;
    justify-content: center;
    align-items: flex-start;
    background: rgba(0,0,0,0.5);
  }

  .timeline {
    width: 90%;
    max-width: 900px;
  }

  .timeline h2 {
    text-align: center;
    color: #fff;
    margin-bottom: 30px;
    text-shadow: 2px 2px 4px #000;
  }

  .timeline ul {
    list-style-type: none;
    padding-left: 0;
  }

  .timeline li {
    background: rgba(255, 255, 255, 0.8);
    border-left: 6px solid #c00;
    margin: 15px 0;
    padding: 15px 25px;
    border-radius: 4px;
    box-shadow: 2px 2px 6px rgba(0,0,0,0.3);
  }

  .timeline li strong {
    color: #c00;
  }

  .timeline li ul {
    margin-top: 10px;
    margin-left: 25px;
  }

  .timeline li ul li {
    background: rgba(255, 255, 255, 0.9);
    border-left: 4px solid #c00;
    margin: 8px 0;
    padding: 8px 15px;
  }

</style>
</head>
<body>

<div class="timeline-container">
  <div class="timeline">
    <h2>L&iacute;nea del tiempo detallada de la afici&oacute;n del Club Deportivo Toluca</h2>
    <ul>
      <li><strong>1917:</strong> Fundaci&oacute;n del club. La afici&oacute;n comienza de manera local, con seguidores principalmente de la ciudad de Toluca.</li>
      <li><strong>1950s:</strong> Ascenso al m&aacute;ximo circuito en 1953. La afici&oacute;n crece al poder seguir partidos de primera divisi&oacute;n.</li>
      <li><strong>1960-1970:</strong> Primeros t&iacute;tulos importantes (1966-67, 1967-68, 1974-75). Comienzan a aparecer las primeras barras organizadas, y los partidos empiezan a atraer m&aacute;s p&uacute;blico.</li>
      <li><strong>1980s:</strong> Per&iacute;odo de sequ&iacute;a deportiva. La asistencia disminuye, pero se consolidan grupos de seguidores fieles que mantienen la pasi&oacute;n viva.</li>
      <li><strong>1990s:</strong>
        <ul>
          <li>1998: T&iacute;tulo de Verano 1998. La afici&oacute;n regresa masivamente al estadio.</li>
          <li>1999-2000: Nuevos campeonatos. Surgen los primeros tifos organizados y coreograf&iacute;as de las barras.</li>
          <li>Se comienzan a usar banderas y mantas m&aacute;s grandes, identificando al Toluca como &ldquo;Infierno Rojo&rdquo;.</li>
        </ul>
      </li>
      <li><strong>2000s:</strong>
        <ul>
          <li>2002, 2005, 2008: Apertura campeonatos. La afici&oacute;n se hace m&aacute;s visible, con grupos de animaci&oacute;n organizados.</li>
          <li>Creaci&oacute;n de espacios de hinchas dentro y fuera del estadio, fomentando identidad y participaci&oacute;n.</li>
        </ul>
      </li>
      <li><strong>2010s:</strong>
        <ul>
          <li>2010: Bicentenario, nuevo t&iacute;tulo. La afici&oacute;n participa activamente en festejos y celebraciones en la ciudad.</li>
          <li>2017: Centenario del club. Remodelaci&oacute;n del Estadio Nemesio Diez. Momentos clave de identidad y orgullo de la afici&oacute;n.</li>
          <li>Surge mayor cobertura medi&aacute;tica de los aficionados y sus actividades.</li>
        </ul>
      </li>
      <li><strong>2020s:</strong>
        <ul>
          <li>2022: Reconocimientos institucionales al papel de la afici&oacute;n.</li>
          <li>2023-2025: Celebraciones de 106, 107 y 108 a&ntilde;os. La afici&oacute;n mantiene sus barras, tifos y participaci&oacute;n activa en redes y eventos.</li>
          <li>Se consolidan plataformas digitales y actividades fuera del estadio que involucran a los seguidores.</li>
        </ul>
      </li>
    </ul>
  </div>
</div>

</body>
</html>
